## Pivot Table Analysis

This notebook focuses on multi-dimensional data aggregation using pandas pivot_table.

In [11]:
import pandas as pd
df = pd.read_csv("tips.csv")

In [12]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [13]:
pd.pivot_table(df, values="tip", index="day", aggfunc="mean")

           tip
day
Fri   2.734737
Sat   2.993103
Sun   3.255132
Thur  2.771452

### Question: Which days generate the highest total revenue?

In [14]:
pd.pivot_table(
    df,
    values="total_bill",
    index="day",
    aggfunc="sum"
)

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [15]:
pd.pivot_table(
    df,
    values="total_bill",
    index="day",
    aggfunc="mean"
)

      total_bill
day
Fri    17.151579
Sat    20.441379
Sun    21.410000
Thur   17.682742

In [16]:
pd.pivot_table(
    df,
    values="total_bill",
    index="day",
    aggfunc="count"
)

      total_bill
day
Fri           19
Sat           87
Sun           76
Thur          62

In [17]:
df["day_type"] = df["day"].apply(
    lambda x: "Weekend" if x in ["Sat", "Sun"] else "Weekday"
)

In [18]:
pd.pivot_table(
    df,
    values="total_bill",
    index="day_type",
    aggfunc=["sum", "mean", "count"]
)

                sum       mean      count
         total_bill total_bill total_bill
day_type
Weekday     1422.21  17.558148         81
Weekend     3405.56  20.893006        163

*Is the difference between weekend and weekday larger than the difference between individual days?*

In [19]:
pd.pivot_table(
    df,
    values="total_bill",
    index="day",
    aggfunc=["sum", "mean"]
)

            sum       mean
     total_bill total_bill
day
Fri      325.88  17.151579
Sat     1778.40  20.441379
Sun     1627.16  21.410000
Thur    1096.33  17.682742

In [20]:
pd.pivot_table(
    df,
    values="total_bill",
    index="day_type",
    aggfunc=["sum", "mean"]
)

                sum       mean
         total_bill total_bill
day_type
Weekday     1422.21  17.558148
Weekend     3405.56  20.893006

## Comparison: Weekend vs Weekday vs Individual Days

While the weekend/weekday split reveals a strong overall revenue pattern, further analysis shows that differences between individual weekdays (e.g., Thursday vs Friday) are also substantial.
In contrast, Saturday and Sunday display more similar revenue performance.
From a managerial perspective, this suggests that high-level planning can rely on the weekend/weekday distinction, while day-level analysis is more suitable for operational decisions such as staffing and scheduling.

## Business Insights

Although Saturday generates the highest total revenue, Sunday shows a comparable level of revenue with fewer customers.
This suggests higher average spending per customer on Sundays, which may lead to improved operational efficiency due to lower staffing requirements.

Additionally, weekend days generate significantly higher total revenue than weekdays.
This increase is driven primarily by higher customer volume rather than substantially higher average bills.
This suggests weekends require higher staffing levels, while weekdays may benefit from traffic-boosting promotions.